<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_min</key>
	<string>2.1</string>
	<key>pfm_app_url</key>
	<string>https://github.com/root3nl/SupportApp</string>
	<key>pfm_description</key>
	<string>SupportApp Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/root3nl/SupportApp</string>
	<key>pfm_domain</key>
	<string>nl.root3.support</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2021-02-12T11:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures SupportApp settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SupportApp</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>nl.root3.support</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>nl.root3.support</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>First Row</string>
				<string>Second Row</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>Title</string>
					<string>Logo</string>
					<string>LogoDarkMode</string>
					<string>StatusBarIcon</string>
					<string>StatusBarIconSFSymbol</string>
					<string>StatusBarIconNotifierEnabled</string>
					<string>CustomColor</string>
					<string>CustomColorDarkMode</string>
					<string>ErrorMessage</string>
				</array>
				<key>First Row</key>
				<array>
					<string>HideFirstRow</string>
					<string>FirstRowTitleLeft</string>
					<string>FirstRowSubtitleLeft</string>
					<string>FirstRowTypeLeft</string>
					<string>FirstRowLinkLeft</string>
					<string>FirstRowSymbolLeft</string>
					<string>FirstRowTitleRight</string>
					<string>FirstRowSubtitleRight</string>
					<string>FirstRowTypeRight</string>
					<string>FirstRowLinkRight</string>
					<string>FirstRowSymbolRight</string>
				</array>
				<key>Second Row</key>
				<array>
					<string>HideSecondRow</string>
					<string>SecondRowTitleLeft</string>
					<string>SecondRowSubtitleLeft</string>
					<string>SecondRowTypeLeft</string>
					<string>SecondRowLinkLeft</string>
					<string>SecondRowSymbolLeft</string>
					<string>SecondRowTitleMiddle</string>
					<string>SecondRowSubtitleMiddle</string>
					<string>SecondRowTypeMiddle</string>
					<string>SecondRowLinkMiddle</string>
					<string>SecondRowSymbolMiddle</string>
					<string>SecondRowTitleRight</string>
					<string>SecondRowSubtitleRight</string>
					<string>SecondRowTypeRight</string>
					<string>SecondRowLinkRight</string>
					<string>SecondRowSymbolRight</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
<!-- ============= TAB: General -->
		<dict>
			<key>pfm_description</key>
			<string>Text shown in the top left corner when the app opens.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>Title</string>
			<key>pfm_title</key>
			<string>Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Support</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the logo shown in the top right corner when the app opens. Scales to 48 points maximum height.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>Logo</string>
			<key>pfm_title</key>
			<string>Custom Logo</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the logo shown in the top right corner when the app opens for Dark Mode. Scales to 48 points maximum height.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>LogoDarkMode</string>
			<key>pfm_title</key>
			<string>Custom Logo Dark Mode</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the status bar icon shown in the menu bar. Recommended: PNG, 16x16 points.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>StatusBarIcon</string>
			<key>pfm_title</key>
			<string>Custom Status Bar Icon</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Custom status bar icon using an SF Symbol. Ignored when StatusBarIcon is also set.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>StatusBarIconSFSymbol</string>
			<key>pfm_title</key>
			<string>Custom Status Bar Icon using SF Symbols</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>lifepreserver</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Shows a small notification badge in the Status Bar Icon when there is an Apple Software Update available.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>StatusBarIconNotifierEnabled</string>
			<key>pfm_title</key>
			<string>Notification badge in Status Bar Icon</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>HEX color in RGB format. Example: #8cc63f. Leave empty to use macOS Accent Color.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>CustomColor</string>
			<key>pfm_title</key>
			<string>Custom Color</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>#8cc63f</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>HEX color in RGB format for Dark Mode. Example: #8cc63f. CustomColor is used when CustomColorDarkMode is not specified.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>CustomColorDarkMode</string>
			<key>pfm_title</key>
			<string>Custom Color Dark Mode</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>#8cc63f</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Shown when clicking an action results in an error.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>ErrorMessage</string>
			<key>pfm_title</key>
			<string>Custom error message</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Please contact IT support</string>
		</dict>

<!-- ============= TAB: First Row -->
		<dict>
			<key>pfm_description</key>
			<string>Hide the first row with configurable items.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>HideFirstRow</string>
			<key>pfm_title</key>
			<string>Hide the first row</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
<!-- ============= TAB: First Row - Left -->
		<dict>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowTitleLeft</string>
			<key>pfm_title</key>
			<string>Left: Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Remote Support</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. App by default.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowSubtitleLeft</string>
			<key>pfm_title</key>
			<string>Left: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will appear under title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowTypeLeft</string>
			<key>pfm_title</key>
			<string>Left: Type</string>
			<key>pfm_range_list</key>
				<array>
					<string>App</string>
					<string>URL</string>
					<string>Command</string>
				</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app or link that should be opened.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowLinkLeft</string>
			<key>pfm_title</key>
			<string>Left: Link</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>com.apple.ScreenSharing</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowSymbolLeft</string>
			<key>pfm_title</key>
			<string>Left: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>cursorarrow</string>
		</dict>
<!-- ============= TAB: First Row - Right -->
		<dict>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowTitleRight</string>
			<key>pfm_title</key>
			<string>Right: Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Company Store</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. App by default.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowSubtitleRight</string>
			<key>pfm_title</key>
			<string>Right: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will appear under title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowTypeRight</string>
			<key>pfm_title</key>
			<string>Right: Type</string>
			<key>pfm_range_list</key>
				<array>
					<string>App</string>
					<string>URL</string>
					<string>Command</string>
				</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app or link that should be opened.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowLinkRight</string>
			<key>pfm_title</key>
			<string>Right: Link</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>com.apple.AppStore</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>FirstRowSymbolRight</string>
			<key>pfm_title</key>
			<string>Right: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>cart.fill</string>
		</dict>
<!-- ============= TAB: Second Row -->
		<dict>
			<key>pfm_description</key>
			<string>Hide the second row with configurable items.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>HideSecondRow</string>
			<key>pfm_title</key>
			<string>Hide the second row</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
<!-- ============= TAB: Second Row - Left -->
		<dict>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowTitleLeft</string>
			<key>pfm_title</key>
			<string>Left: Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Support Ticket</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will replace the title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowSubtitleLeft</string>
			<key>pfm_title</key>
			<string>Left: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. URL by default.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowTypeLeft</string>
			<key>pfm_title</key>
			<string>Left: Type</string>
			<key>pfm_range_list</key>
				<array>
					<string>App</string>
					<string>URL</string>
					<string>Command</string>
				</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app or link that should be opened.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowLinkLeft</string>
			<key>pfm_title</key>
			<string>Left: Link</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://yourticketsystem.tld</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowSymbolLeft</string>
			<key>pfm_title</key>
			<string>Left: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>ticket</string>
		</dict>
<!-- ============= TAB: Second Row - Middle -->
		<dict>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowTitleMiddle</string>
			<key>pfm_title</key>
			<string>Middle: Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Email</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will replace the title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowSubtitleMiddle</string>
			<key>pfm_title</key>
			<string>Middle: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. URL by default.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowTypeMiddle</string>
			<key>pfm_title</key>
			<string>Middle: Type</string>
			<key>pfm_range_list</key>
				<array>
					<string>App</string>
					<string>URL</string>
					<string>Command</string>
				</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app or link that should be opened.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowLinkMiddle</string>
			<key>pfm_title</key>
			<string>Middle: Link</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>mailto:support@company.tld</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowSymbolMiddle</string>
			<key>pfm_title</key>
			<string>Middle: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>envelope</string>
		</dict>
<!-- ============= TAB: Second Row - Right -->
		<dict>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowTitleRight</string>
			<key>pfm_title</key>
			<string>Right: Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Phone</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will replace the title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowSubtitleRight</string>
			<key>pfm_title</key>
			<string>Right: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. URL by default.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowTypeRight</string>
			<key>pfm_title</key>
			<string>Right: Type</string>
			<key>pfm_range_list</key>
				<array>
					<string>App</string>
					<string>URL</string>
					<string>Command</string>
				</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app or link that should be opened.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowLinkRight</string>
			<key>pfm_title</key>
			<string>Right: Link</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>tel:+31000000000</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/root3nl/SupportApp</string>
			<key>pfm_name</key>
			<string>SecondRowSymbolRight</string>
			<key>pfm_title</key>
			<string>Right: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>phone</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>SupportApp</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>